# KW Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KW Property
SymbolTypeId Class See Also
---
Symbol kW, indicating unit Kilowatts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KW { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KW As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KW {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace